Repository: alexmarch/BestPostAssistBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: Add channel/chat
ru: Добавить канал/чат

source: Create post
ru: Создать пост

source: Settings
ru: Настройки

source: Edit post
ru: Редактировать пост

source: My profile
ru: Мой профиль

source: Channel
ru: Канал

source: Chat
ru: Чат

source: Main menu
ru: Главное меню

source: 📝 Edit text
ru: 📝 Редактировать текст

source: 📎 Add media
ru: 📎 Добавить медиа

source: 🎛️ Add buttons
ru: 🎛️ Добавить кнопки

source: 😊 Add reactions
ru: 😊 Добавить реакции

source: Sound 🔊
ru: Звук 🔊

source: Comments 💬
ru: Комментарии 💬

source: Pin 📌
ru: Закрепить 📌

source: Auto-signature ✍️
ru: Автоподпись ✍️

source: ‹ Channels/chats
ru: ‹ Каналы/чаты

source: Next ›
ru: Далее ›

source: ✅⚡️ Confirm
ru: ✅⚡️ Подтвердить

source: Change post time
ru: Изменить время поста

source: ‹ Back to post
ru: ‹ Назад к посту

source: 🔼 Top with preview
ru: 🔼 Вверх с превью

source: 🔽 Bottom with preview
ru: 🔽 Вниз с превью

source: ‹ Back
ru: ‹ Назад

source: 📅 Multiposting schedule
ru: 📅 Расписание мультипостинга

source: 🗒️ Posting task log
ru: 🗒️ Журнал задач публикации

source: Off
ru: Выкл

source: On
ru: Вкл

source: 💼 Report to client
ru: 💼 Отчёт клиенту

source: ➡️ Forward
ru: ➡️ Переслать

source: 📅 Schedule
ru: 📅 Расписание

source: 🚀 Publish
ru: 🚀 Опубликовать

source: 🕒 Delete timer
ru: 🕒 Удалить таймер

source: 🤖 AI integration
ru: 🤖 Интеграция ИИ

source: 📊 CRM integration
ru: 📊 Интеграция CRM

source: ✓ Select all
ru: ✓ Выбрать все

source: ⚡ CONFIRM
ru: ⚡ ПОДТВЕРДИТЬ

source: 🗑️ Delete media
ru: 🗑️ Удалить медиа

source: 🗑️ Delete reactions
ru: 🗑️ Удалить реакции

source: 🗑️ Delete buttons
ru: 🗑️ Удалить кнопки

source: Scheduled posts
ru: Отложенные посты
uk: Відкладені пости

source: Looped posts
ru: Зацикленные посты
uk: Зациклені пости

source: Multiposting to channels and chats
ru: Мультипостинг в каналы и чаты
uk: Мультипостинг у канали та чати

source: Multi-editor for scheduled and looped posts
ru: Мультиредактор отложенных и зацикленных постов
uk: Мультиредактор відкладених і зациклених постів

source: Auto-signature of posts directly in the channel
ru: Автоподпись постов прямо в канале
uk: Автопідпис постів прямо в каналі

source: <b>Automation Bot</b> for managing Telegram Channels and Chats <b>🤖 The bot creates:</b> {content}
ru: <b>Бот Автоматизации</b> ведения Telegram Каналов и Чатов <b>🤖 Бот создает:</b> {content}
uk: <b>Бот автоматизації</b> ведення Telegram каналів і чатів <b>🤖 Бот створює:</b> {content}

source: ⬇️ Send a media file
ru: ⬇️ Отправьте медиафайл
uk: ⬇️ Надішліть медіафайл

source: ⚠️ File size exceeds 5 MB. Please select another file.
ru: ⚠️ Размер файла превышает 5 МБ. Пожалуйста, выберите другой файл.
uk: ⚠️ Розмір файлу перевищує 5 МБ. Будь ласка, виберіть інший файл.

source: Sending messages
ru: Отправка сообщений
uk: Надсилання повідомлень

source: Deleting messages
ru: Удаление сообщений
uk: Видалення повідомлень

source: Editing messages
ru: Изменение сообщений
uk: Редагування повідомлень

source: Invite links
ru: Пригласительные ссылки
uk: Запрошувальні посилання

source: To connect the bot, assign it as an Administrator in the desired channel/chat, granting the following permissions:
ru: Для подключения бота назначьте его Администратором в нужный вам канал/чат, выдав следующие права:
uk: Щоб підключити бота, призначте його адміністратором у потрібному вам каналі/чаті, надавши такі права:

source: Then forward a post from your channel/chat here and you can start creating posts ✈️
ru: Затем перешлите пост из вашего канала/чата прямо сюда и можно создавать посты ✈️
uk: Потім перешліть пост із вашого каналу/чату сюди і можна створювати пости ✈️

source: ⬇️ Send the post you want to edit here
ru: ⬇️ Отправьте сюда пост, который хотите изменить
uk: ⬇️ Надішліть сюди пост, який хочете змінити

source: ⚠️ Post not found. Please send a valid post.
ru: ⚠️ Пост не найден. Отправьте корректный пост.
uk: ⚠️ Пост не знайдено. Надішліть коректний пост.

source: ⬇️ Create or forward the post you need
ru: ⬇️ Создайте или перешлите нужный вам пост
uk: ⬇️ Створіть або перешліть потрібний вам пост

source: ⚠️ User not found. Please enter a valid client ID/username
ru: ⚠️ Пользователь не найден. Введите корректный ID/юзернейм клиента
uk: ⚠️ Користувача не знайдено. Введіть коректний ID/юзернейм клієнта

source: ✅ Client successfully added
ru: ✅ Клиент успешно добавлен
uk: ✅ Клієнта успішно додано

source: ⚠️ Please select channels/chats first!
ru: ⚠️ Сначала выберите каналы/чаты!
uk: ⚠️ Спочатку виберіть канали/чати!

source: Specify the date in the calendar from which to pause publications: {date}
ru: Укажите дату в календаре, с которой следует приостановить публикации: {date}
uk: Вкажіть дату в календарі, з якої слід призупинити публікації: {date}

source: Specify the date in the calendar for the scheduled post: {date}
ru: Укажите дату в календаре для отложенного поста: {date}
uk: Вкажіть дату в календарі для відкладеного поста: {date}

source: 🚀 <b>CONFIRM</b> post publication.
ru: 🚀 <b>ПОДТВЕРДИТЕ</b> публикацию поста.
uk: 🚀 <b>ПІДТВЕРДІТЬ</b> публікацію поста.

source: 🌟 Available only with a paid subscription!
ru: 🌟 Доступно только в платной подписке!
uk: 🌟 Доступно лише з платною підпискою!

source: ℹ️ For the report to be delivered, your client must start the bot.
ru: ℹ️ Чтобы отчёт был доставлен, ваш клиент должен запустить бота.
uk: ℹ️ Щоб звіт був доставлений, ваш клієнт повинен запустити бота.

source: ⬆️ <b>Report to client</b> Send the client's username here, if not available send their ID or forward a message from the client. {info_message}
ru: ⬆️ <b>Отчёт клиенту</b> Отправьте сюда юзернейм клиента, если его нет то отправьте его ID или перешлите сообщение от имени клиента. {info_message}
uk: ⬆️ <b>Звіт клієнту</b> Надішліть сюди юзернейм клієнта, якщо його немає, то надішліть його ID або перешліть повідомлення від імені клієнта. {info_message}

source: ℹ️ For the post copy to be delivered, your client must start the bot.
ru: ℹ️ Чтобы копия поста была доставлена, ваш клиент должен запустить бота.
uk: ℹ️ Щоб копія поста була доставлена, ваш клієнт повинен запустити бота.

source: ⬆️ <b>Copy of post</b> Send the client's username here, if not available send their ID or forward a message from the client. {info_message}
ru: ⬆️ <b>Копия поста</b> Отправьте сюда юзернейм клиента, если его нет то отправьте его ID или перешлите сообщение от имени клиента. {info_message}
uk: ⬆️ <b>Копія поста</b> Надішліть сюди юзернейм клієнта, якщо його немає, то надішліть його ID або перешліть повідомлення від імені клієнта. {info_message}

source: ✅ Post published successfully!
ru: ✅ Пост успешно опубликован!
uk: ✅ Пост успішно опубліковано!

source: ✅ <b>Sending completed.</b> 📨 Delivered {sended}/{total}: {channels}
ru: ✅ <b>Отправка завершена.</b> 📨 Доставлено {sended}/{total}: {channels}
uk: ✅ <b>Відправлення завершено.</b> 📨 Доставлено {sended}/{total}: {channels}

source: <b>📅 Publication date:</b> {date} <b>🕒 Interval:</b> {interval}
ru: <b>📅 Дата публикации:</b> {date} <b>🕒 Интервал:</b> {interval}
uk: <b>📅 Дата публікації:</b> {date} <b>🕒 Інтервал:</b> {interval}

source: ✅ <b>Publication completed.</b> {multiposting} 🔔 <b>ATTENTION!</b> You will receive a notification about the post publication.
ru: ✅ <b>Публикация завершена.</b> {multiposting} 🔔 <b>ВНИМАНИЕ!</b> Вы получите уведомление о публикации поста.
uk: ✅ <b>Публікацію завершено.</b> {multiposting} 🔔 <b>УВАГА!</b> Ви отримаєте сповіщення про публікацію поста.

source: Media position (🔼 Top with preview | 🆙 Top without preview | 🔽 Bottom with preview)
ru: Положение медиа (🔼 Вверх с превью | 🆙 Вверх без превью | 🔽 Вниз с превью)
uk: Положення медіа (🔼 Вгору з прев'ю | 🆙 Вгору без прев'ю | 🔽 Вниз з прев'ю)

source: ✅ Media file deleted!
ru: ✅ Медиафайл удален!
uk: ✅ Медіафайл видалено!

source: ⬇️ Send the new post text
ru: ⬇️ Отправьте новый текст поста
uk: ⬇️ Надішліть новий текст поста

source: 🏷 Select channels/chats for publication
ru: 🏷 Выберите каналы/чаты для публикации
uk: 🏷 Виберіть канали/чати для публікації

source: ⚠️ Please confirm the selection of channels/chats!
ru: ⚠️ Подтвердите выбор каналов/чатов!
uk: ⚠️ Підтвердіть вибір каналів/чатів!

source: ➡️ Publication settings menu for the post
ru: ➡️ Меню настроек публикаций для поста
uk: ➡️ Меню налаштувань публікації для поста

source: 📅 Specify the date in the calendar for the scheduled post
ru: 📅 Укажите дату в календаре для отложенного поста
uk: 📅 Вкажіть дату в календарі для відкладеного поста

source: <b>📅 Publication date:</b> {date}
ru: <b>📅 Дата публикации:</b> {date}
uk: <b>📅 Дата публікації:</b> {date}

source: ⚠️ Select a publication date!
ru: ⚠️ Выберите дату публикации!
uk: ⚠️ Виберіть дату публікації!

source: <b>⬇️ Send buttons in the format:</b> {example} Buttons can be separated by the `|` symbol for columns in a row: {columns_example}
ru: <b>⬇️ Отправьте кнопки в формате:</b> {example} Кнопки могут быть разделены символом `|` для столбцов в строке: {columns_example}
uk: <b>⬇️ Надішліть кнопки у форматі:</b> {example} Кнопки можуть бути розділені символом `|` для стовпців у рядку: {columns_example}

source: <b>⬇️ Send reactions in the format:</b> {emoji_example} <b>Or in text format:</b> {text_example}
ru: <b>⬇️ Отправьте реакции в формате:</b> {emoji_example} <b>Либо в текстовом формате:</b> {text_example}
uk: <b>⬇️ Надішліть реакції у форматі:</b> {emoji_example} <b>Або у текстовому форматі:</b> {text_example}

source: 🗑️ Select the interval after which the post will be deleted
ru: 🗑️ Выберите интервал через сколько пост будет удален
uk: 🗑️ Виберіть інтервал, через який пост буде видалено

source: Channel/chat already added: {title}
ru: Канал/чат уже добавлен: {title}
uk: Канал/чат вже додано: {title}

source: You have selected the channel: {title}
ru: Вы выбрали канал: {title}
uk: Ви вибрали канал: {title}

source: ⚠️ Error adding reactions. Please try again.
ru: ⚠️ Ошибка при добавлении реакций. Попробуйте еще раз.
uk: ⚠️ Помилка при додаванні реакцій. Спробуйте ще раз.

source: ⚠️ Error adding buttons. Please try again.
ru: ⚠️ Ошибка при добавлении кнопок. Попробуйте еще раз.
uk: ⚠️ Помилка при додаванні кнопок. Спробуйте ще раз.

source: <b>Name: {name}</b> <b>ID:<code>{id}</code></b> <b>Link: {link}</b> <b>📣 Channels/chats: <code>{channels}</code></b> <b>👥 Posts: <code>{posts}</code></b>
ru: <b>Имя: {name}</b> <b>ID:<code>{id}</code></b> <b>Cсылка: {link}</b> <b>📣 Каналов/чатов: <code>{channels}</code></b> <b>👥 Постов: <code>{posts}</code></b>
uk: <b>Ім'я: {name}</b> <b>ID:<code>{id}</code></b> <b>Посилання: {link}</b> <b>📣 Каналів/чатів: <code>{channels}</code></b> <b>👥 Постів: <code>{posts}</code></b>

source: ⚙️ Settings:
ru: ⚙️ Настройки:
uk: ⚙️ Налаштування:

source: 📋 <b>Post publishing tasks:</b> <b>Total tasks: <code>{count}</code></b>
ru: 📋 <b>Задачи публикации постов:</b> <b>Всего задач: <code>{count}</code></b>
uk: 📋 <b>Завдання публікації постів:</b> <b>Всього завдань: <code>{count}</code></b>

source: ✅ Post publishing task <code>{job_id}</code> deleted.
ru: ✅ Задача публикации поста <code>{job_id}</code> удалена.
uk: ✅ Завдання публікації поста <code>{job_id}</code> видалено.

source: ⚠️ Post publishing task <code>{job_id}</code> not found.
ru: ⚠️ Задача публикации поста <code>{job_id}</code> не найдена.
uk: ⚠️ Завдання публікації поста <code>{job_id}</code> не знайдено.

source: ⏰ Multiposting schedule deleted. Now posts will be published immediately after creation.
ru: ⏰ Расписание мультипостинга удалено. Теперь посты будут выходить сразу после создания.
uk: ⏰ Розклад мультипостингу видалено. Тепер пости будуть виходити одразу після створення.

source: <b>🗓 Schedule</b> Here you can set a daily schedule for posts in multiposting mode, so you can plan publications in several channels with one click. To set a schedule, send the post times as a list in any convenient format. 🕒 <b>Time-based publishing</b> (send time in any of the formats): {time_examples} 🕒 <b>Interval-based publishing:</b> {interval_examples} ⚠️ <b>IMPORTANT!</b> The minimum auto-repeat/loop interval is 15m (minutes) {current_schedule} {schedule_block}
ru: <b>🗓 Расписание</b> Здесь можно установить ежедневное расписание постов в режиме мультипостинга, чтобы в дальнейшем планировать публикации всего одним кликом сразу в несколько каналов. Чтобы задать расписание, отправь время выхода постов в виде списка в любом удобном формате. 🕒 <b>Публикация по времени</b>(отправте время в любом из форматов): {time_examples} 🕒 <b>Настройка интервалов выхода постов:</b> {interval_examples} ⚠️ <b>ВАЖНО!</b> Минимальное время автоповтора/зацикленности 15m (минут) {current_schedule} {schedule_block}
uk: <b>🗓 Розклад</b> Тут можна встановити щоденний розклад постів у режимі мультипостингу, щоб надалі планувати публікації одним кліком одразу в кілька каналів. Щоб задати розклад, надішліть час виходу постів у вигляді списку у будь-якому зручному форматі. 🕒 <b>Публікація за часом</b> (надішліть час у будь-якому з форматів): {time_examples} 🕒 <b>Налаштування інтервалів виходу постів:</b> {interval_examples} ⚠️ <b>ВАЖЛИВО!</b> Мінімальний час автоповтору/зацикленості 15m (хвилин) {current_schedule} {schedule_block}

source: ⚠️ Please enter at least one time.
ru: ⚠️ Пожалуйста, введите хотя бы одно время.
uk: ⚠️ Будь ласка, введіть хоча б один час.

source: ⚠️ Time format error, please try again.
ru: ⚠️ Ошибка формата времени, повторите ввод.
uk: ⚠️ Помилка формату часу, спробуйте ще раз.

source: ⏰ <b>Current publishing schedule:</b> {schedule}
ru: ⏰ <b>Текущее расписание публикации:</b> {schedule}
uk: ⏰ <b>Поточний розклад публікації:</b> {schedule}
